app/controllers/students_controller.rb

def update
    set_student
    @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-08-13 19:42:54.654330"], ["id", 1]]

def destroy
    set_student
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 5]]